package com.example.androidlab_22_23.model

object CharacterRepository {
    val characters = arrayListOf(
        Character(
            id = 0,
            name = "Танджиро Камадо",
            affiliation = "Истребитель демонов",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/e/e1/Tanjiro_anime.png/revision/latest?cb=20181128204204",
            description = "Танджиро Камадо (竈門かまど炭たん治じ郎ろう Kamado Tanjirō?) — главный герой манги и аниме «Клинок, рассекающий демонов». Он стал истребителем демонов, чтобы найти ответственного за убийство его семьи и превращение его сестры в демона.",
            history = "Танджиро вырос в горах вместе со своими родителями, братьями и сёстрами, будучи старшим ребёнком в семье Камадо. Его отец Танджуро умер от болезни, когда Танджиро был ещё совсем маленьким, потому Танджиро взял на себя роль кормильца. Он очень любил свою семью и заботился о ней, как только мог. Однажды один из братьев Танджиро случайно толкнул горячий чайник, и, пытаясь защитить ребёнка, Танджиро получил свой шрам на лбу.\n" +
                    "\n" +
                    "Танджиро продавал уголь в ближайшем городе, чтобы заработать деньги для семьи, и, похоже, он появлялся там довольно часто, так как горожане легко его узнавали и просили о помощи."

        ),
        Character(
            id = 1,
            name = "Зеницу Агацума",
            affiliation = "Истребитель демонов",
            cover = "https://static.wikia.nocookie.net/kimetsunoyaiba/images/e/e0/Zenitsu_anime_design.png/revision/latest?cb=20190523134359&path-prefix=ru",
            description = "Зеницу Агацума (我あが妻つま善ぜん逸いつ Agatsuma Zen'itsu?) — истребитель демонов и один из главных героев, путешествующих с Танджиро Камадо.",
            history = "Когда Зеницу был моложе, он был влюблён в девушку, которая обманом заставляла его собирать деньги, чтобы избавиться от своих долгов. Из-за неё у Зеницу появились проблемы, но его спас бывший столп грома Джигоро Куваджима. Чтобы вернуть ему долг, Зеницу пришлось пройти через адские тренировки и стать истребителем демонов.\n" +
                    "\n" +
                    "Зеницу находился под опекой Шихана и тренировался вместе с его старшим учеником Кайгаку. На одной из тренировок Зеницу забрался на дерево, потому что не хотел больше тренироваться, и его внезапно ударила молния, из-за чего волосы приняли светлый оттенок."
        ),
        Character(
            id = 2,
            name = "Иноске Хашибира",
            affiliation = "Истребитель демонов",
            cover = "https://static.wikia.nocookie.net/kimetsunoyaiba/images/9/94/Inosuke_anime_design.png/revision/latest?cb=20190526144228&path-prefix=ru",
            description = "Иноске Хашибира (嘴はし平びら伊い之の助すけ Hashibira Inosuke?) — охотник на демонов, путешествующий в компании Танджиро Камадо.",
            history = "Иноске был выращен кабанами — всю жизнь до Финального Отбора он жил в лесу на горе, пока однажды не решил отправиться в путешествие, чтобы стать сильнее.\n" +
                    "\n" +
                    "Он всегда считал, что у него никогда не было родителей, но позже он узнаёт, что был рождён в неблагополучной семье, отец которой часто выпивал и избивал свою жену, поэтому она, взяв новорожденного Иноске, сбежала из семьи в храм Культа Вечного Рая, основанный демоном Доума. Он принял их пожить в его храме. Стоит упомянуть, что Доума считал Котоху красивой, но очень глупой. Мать любила петь для Иноске одну колыбельную, в которой лишь изредка меняла слова. Однажды, случайно увидев, какие вещи на самом деле творит Доума, она в страхе бежала вместе со своим ребенком в лес. Преследуемая демоном, она добежала до обрыва, где ей пришлось отпустить Иноске в реку, в которой позже его нашли кабаны."

        ),
        Character(
            id = 3,
            name = "Канао Цуюри",
            affiliation = "Истребитель демонов",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/c/cd/Kanao_anime.png/revision/latest?cb=20191028091138",
            description = "Канао Цуюри (栗つ花ゆ落りカナヲ Tsuyuri Kanao?) — истребительница демонов, а также приёмная сестра Канаэ и Шинобу Кочо и цугуко Шинобу Кочо.",
            history = "Канао родилась в очень бедной семье, и её родители не могли обеспечить себе безопасность, не говоря уже о благополучном детстве для детей, поэтому они продали её в рабство.\n" +
                    "\n" +
                    "Позже её выкупили сёстры Канаэ и Шинобу Кочо и привели в Поместье бабочки. Первое время у Канао были большие проблемы с коммуникацией. Она не делала ничего, если ей не дали указание - даже не могла самостоятельно поесть, пока ей не скажут этого сделать. Канаэ попыталась решить эту проблему, подарив Канао монетку, которую нужно было подбрасывать каждый раз, когда Канао предстоит сделать самостоятельный выбор."
        ),
        Character(
            id = 4,
            name = "Генья Шинадзугава",
            affiliation = "Истребитель демонов",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/b/b9/Genya_Anime.png/revision/latest?cb=20191220221437",
            description = "Генья Шинадзугава (不死しなず川がわ 玄げん弥や Shinazugawa Gen'ya?) — истребитель демонов и младший брат столпа ветра Санеми Шинадзугавы.",
            history = "Генья вырос в многодетной семье. Его мать много работала, а отец бездельничал, выпивал и периодически избивал жену и детей. Позже отца убили, и Генья c Санеми поклялись защищать мать и братьев с сёстрами.\n" +
                    "\n" +
                    "Однажды, их мать долго не возвращалась домой. Когда в дверь постучали, они подумали, что она наконец вернулась. Это и правда была их мама, но уже не имевшая рассудок, так как обратилась в демона. Сёстры и братья Санеми и Геньи умерли в один момент. Санеми удалось убить демона, но после того, как он узнал в ней мать, Генья стал обвинять Санеми в её убийстве и начал верить в то, что их семью атаковала не она, а волк.\n" +
                    "\n" +
                    "Позже, Генья осознал свою ошибку и пытался наладить отношения с братом. Он тренировался, чтобы стать охотником на демонов, однако, он так и не смог научиться Стилям Дыхания. Как-то он обнаружил, что может есть демонов и приобретать их некоторые демонические способности.\n" +
                    "\n" +
                    "Его заметил Гёмей Химеджима, Столп Камня, и начал обучать его. В какой-то момент он встретился с Санеми и попытался извиниться, но тот отверг его, говоря, что у него нет брата. После этого Генья решил стать Столпом, чтобы Санеми смог его признать."
        ),
        Character(
            id = 5,
            name = "Мудзан Кибуцуджи",
            affiliation = "Демоны двенадцати лун (Лидер)",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/0/0e/Muzan_Kibutsuji_Full_Body_%28Anime%29.png/revision/latest?cb=20210731042132",
            description = "Мудзан Кибуцуджи (鬼き舞ぶ辻つじ無む惨ざん Kibutsuji Muzan?) — первый в своем роде демон, прародитель остальных демонов. Антагонист аниме и манги \"Клинок, рассекающий демонов\". Он убил большинство из семьи Камадо и обратил Незуко в демона.",
            history = "Когда Мудзан был ещё в животе матери, его сердце останавливалось несколько раз. Он родился без пульса и не дышал, из-за чего его посчитали мертворождённым, и издал первый крик только тогда, когда его уже собирались кремировать.\n" +
                    "\n" +
                    "Когда Мудзан был молодым парнем, у него диагностировали заболевание, из-за которого он должен был умереть, не дожив и до 20 лет. Доктор, лечивший Мудзана, дал ему прототип лекарства, но Мудзан, разозлённый тем, что его состояние ухудшается, убил своего врача. Позже он понял, что лекарство на самом деле сработало, и его тело стало сильнее. Ему было несложно поедать людей ради выживания, но перед ним встала другая проблема: он не мог находиться под солнцем. Из-за того, что солнечный свет теперь был для него смертельным, Мудзану приходилось вести ночной образ жизни, что его очень злило. В этот момент он сильно пожалел, что убил доктора раньше, чем тот закончил разработку лекарства, названного “голубая паучья лилия”. Мудзан искал паучью лилию, входившую в состав лекарства, по всей стране, но никак не мог найти её, из-за чего начал создавать больше демонов. Он хотел распространить демонов по всему миру, надеясь, что один из них в итоге сможет одолеть солнце или хотя бы найдёт голубую паучью лилию, благодаря чему Мудзан мог бы стать совершенным существом."
        ),
        Character(
            id = 6,
            name = "Кокушибо",
            affiliation = "Первая Высшая Луна",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/f/f3/Kokushibo_colored_body.png/revision/latest?cb=20200413041714",
            description = "Кокушибо (黒死牟 Kokushibo) — главный второстепенный антагонист Клинок, рассекающий демонов: Kimetsu no Yaiba и Первая Высшая Луна (上じょう弦げんの壱いち Jōgen no Ichi?). Почти пять столетий назад в Период Сэнгоку, во время Золотого века истребителей демонов, Кокушибо был человеком по имени Мичикацу Цугикуни (継つぎ国くに 巌みち勝かつ Tsugikuni Michikatsu?) и бывшим членом Корпуса истребителей демонов и старший брат-близнец Ёриичи Цугикуни, сильнейшего истребителя демонов из когда-либо живших.",
            history = "Настоящее имя Кокушибо до встречи с Мудзаном было - Мичикацу Цугикуни.\n" +
                    "\n" +
                    "Он родился вместе со своим младшим братом Ёриичи, в эпоху Сенгоку. Его семья было высокого сословия. Отец решил сделать Мичикацу наследником, когда ему исполнится 10 лет. А Ёриичи отправить в храм. Мичикацу жалел младшего брата, но ему не разрешалось подходить к нему. Тем не менее, он подошел к нему и подарил самодельную дудочку. Из-за этого он получил по лицу.\n" +
                    "\n" +
                    "Когда обоим было по 7 лет, Ёриичи попросил Мичикацу попробовать себя в фехтовании. Мичикацу был поражен от мастерства Ёриичи. Ёриичи одолел учителя за несколько движении. С тех пор Мичикацу презирал и завидовал таланту Ёриичи. Когда он узнал, что Ёриичи все время придерживал больное место матери, его ненависть возросла.\n" +
                    "\n" +
                    "Узнав о талантах Ёриичи, отец решил сделать его наследником. Ёриичи убежал с дома после смерти матери. В конце концов его не нашли, и наследником стал Мичикацу."
        ),
        Character(
            id = 7,
            name = "Доума",
            affiliation = "Вторая высшая луна",
            cover = "https://static.wikia.nocookie.net/kimetsunoyaiba/images/3/34/Doma_Anime.png/revision/latest?cb=20220324172927&path-prefix=ru",
            description = "Доума (童どう磨ま Dōma?) — демон двенадцати лун, занимающий позицию второй высшей луны.",
            history = "Доума родился с необычным цветом глаз, из-за чего его родители думали, что он особенный и может слышать голоса богов. Они воспитывали из него лидера культа вечного рая, которым он оставался до самой смерти.\n" +
                    "\n" +
                    "Когда Доума был ребёнком, его отец часто изменял матери с последовательницами культа, из-за чего та сошла с ума и заколола отца ножом, впоследствии отравив себя и умерев рядом с ним. Несмотря на такое ужасное событие, Доума не испытывал ни грусть, ни одиночество. Единственное, что он хотел в этот момент — это проветрить комнату из-за ужасного запаха крови.\n" +
                    "\n" +
                    "Когда Доуме было 20 лет, Мудзан Кибуцуджи превратил его в демона."
        ),
        Character(
            id = 8,
            name = "Аказа",
            affiliation = "Третья высшая луна",
            cover = "https://static.wikia.nocookie.net/kimetsu-no-yaiba/images/e/e1/Akaza_Full_Body_Design_%28Anime%29.png/revision/latest?cb=20211013090054",
            description = "Аказа (猗あ窩か座ざ Akaza?) — демон двенадцати лун, занимающий позицию третьей высшей луны. Когда он был человеком, его звали Хакуджи.",
            history = "Хакуджи (Аказа, будучи человеком) долгое время заботился о своем больном отце. Чтобы заплатить за лекарства, он выходил в город грабить карманников. Это могло привести к избиениям со стороны магистрата, но он, тем не менее, продолжал красть, пока отец не повесился. В письме, которое он оставил, он заявил, что хочет, чтобы Хакуджи жил полной жизнью, и что он не хочет принимать никаких лекарств, если это было результатом воровства.\n" +
                    "\n" +
                    "С многочисленными татуировками преступника Хакуджи в конце концов был изгнан из Эдо, и именно тогда он встретил Кейзо , владельца додзё без студентов. Кейзо решил взять Хакуджи под свое крыло, чтобы он мог ухаживать за Коюки , больной дочерью Кейзо, после того как ее предыдущий смотритель (ее мать) утонула в результате стресса. Хакуджи в конце концов ухаживал за Коюки, пока, три года спустя, она не была в хорошем состоянии и не смогла выстоять и выполнять работу по дому. Кроме того, он также обучался в качестве ученика Кейзо в стиле Сорю, который исцелил его душу.\n" +
                    "\n" +
                    "В конце концов, Кейзо попросил Хакуджи взять на себя обязанности додзё и стать мужем Коюки, с чем он согласился. Однако после того, как он рассказал своему покойному отцу о своем браке, ему сообщили, что кто-то из соседей додзё отравил Коюки и Кейзо. Разгневанный, Хакуджи хладнокровно пошел в тот додзё и убил всех присутствующих голыми руками. Этот инцидент привлек внимание Мудзана, и именно тогда он превратил Хакуджи в демона в попытке создать двенадцать самых сильных демонов."
        ),
        Character(
            id = 9,
            name = "Незуко Камадо",
            affiliation = "Не определено",
            cover = "https://static.wikia.nocookie.net/kimetsunoyaiba/images/2/2f/Nezuko_anime_design.png/revision/latest?cb=20190522101557&path-prefix=ru",
            description = "Незуко Камадо (竈門かまど禰ね豆ず子こ Kamado Nezuko?) — младшая сестра Танджиро. Она была превращена в демона Мудзаном Кибуцуджи.",
            history = "Будучи еще человеком, Незуко была очень доброй, заботливой старшей сестрой, которая прежде всего думала о других.\n" +
                    "\n" +
                    "Однако, как Демон, Незуко, похоже, забыла значительную часть своих воспоминаний о человеке, помимо тех, что связаны с её семьёй. Она по-прежнему очень заботится и защищает людей, которых считает членами своей семьи, хотя это, в основном, связано с влиянием, которое Саконджи Урокодаки оказал на неё, когда та спала два года. Незуко также сохраняет некоторые из своих человеческих эмоций, поскольку она плачет, когда грустит, и улыбается, когда счастлива, но в целом она выглядит лишенной эмоции по сравнению с человеком. Она всё ещё гораздо спокойнее и менее зла, чем большинство демонов."
        )
    )
}